% % 实现了单个特征散射中心的核心物理方程（论文中的方程 1-6）。给定 7 个参数，此函数计算了频域中的预期雷达回波 。
function  E=model_rightangle(om,fx,fy,fc,x,y,a,r,o_o,L,A)
%%%%%%%%%%%建立属性参数模型%%%%%
%%%%%%%%%%%om、o_o：度; fx、fy、fc:Hz;x、y、L:米；
%%%%%%%%%%%%%%%%*各参数意义:1.fx表示图像x向频率
  %%%%%%%%%%%%%%%%%%%%%%%% 2.fy表示图像y向频率
  %%%%%%%%%%%%%%%%%%%%%%%% 3.b表示图像相对带宽,即图像带宽和中心频率之比
  %%%%%%%%%%%%%%%%%%%%%%%% 4.om表示最大观测角

  %%%%%%%%%%%%%%%%%%%%%%%% 5.x,y分别表示图像中某一坐标值
  %%%%%%%%%%%%%%%%%%%%%%%% 6.a表示频率依赖
 %%%%%%%%%%%%%%%%%%%%%%%%% 7.r表示角度依赖,当判定为分布散射中心时,r=0
  %%%%%%%%%%%%%%%%%%%%%%%% 8.o表示方位角偏离程度
 %%%%%%%%%%%%%%%%%%%%%%%%% 9.L表示物理长度,当判定为局部散射中心时,o,L=0;
 %%%%%%%%%%%%%%%%%%%%%%%%% 10.A表示复幅度;*%%%%%%%%%%%%%%%%%%%%%%
c=3e8;

o_o=o_o*2*pi/360;

f=sqrt(fx*fx+fy*fy);
o=atan(fy/fx);         %%%%%%%%%%o是弧度值

E1=((j*f)/fc)^a;
E2=exp((-j*4*pi*f/c)*(x*cos(o)+y*sin(o)));
% E3=(sin((2*pi*f/c)*L*sin(o-o_o)))/((2*pi*f/c)*L*sin(o-o_o));  %%%%%matlab中的sinc函数定义与数学中的sinc函数定义不同，所以这里用原始的定义，即数学中的定义
E3=sinc(2*f*L*sin(o-o_o)/c);       %%%matlab中的sinc函数定义与数学中的sinc函数定义不同，所以这里要除上一个pi.
%E4=exp(-2*pi*f*r*sin(o));
E4=exp(((-fy/fc)/(2*sin(om/2)))*r);    %%%%%这里r的数量级是0.1


E=A*E1*E2*E3*E4;
% 
% E=A*E3;
%E=E1*E2;
